Revit 2024 API
SpecTypeId.ApparentPower Property
 Apparent Power, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId ApparentPower { get; }
Visual Basic
Public Shared ReadOnly Property ApparentPower As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ApparentPower {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace